Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document._Инвойс</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>InformationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.Поставки</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>InformationRegister.ЦеныЗакупки</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ОприходованиеНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварУжеОплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консигнация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДокументСкидки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВКД_СкидкаПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_НеСоздаватьПриходную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДокументЗатрат</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВКД_ДополнительныеЗатраты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСЗатратами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ИнвойсПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДатаИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьЗамены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьЗатраты_</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_СуммаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_СуммаСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументЗатрат</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВКД_ДополнительныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Замены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриходнаяНакладная/Ext/ManagerModule.bsl
Процедура ЗаполнитьРеквизиты(Форма) Экспорт
	Форма.ИмяЖурнала = "Приходные накладные";
КонецПроцедуры

Процедура УстановитьВсеПараметры(Форма) Экспорт

КонецПроцедуры

#Если Сервер Тогда
	
Процедура ПечатьДокумента_(Тек, Поз, Таб, Параметры = 0) Экспорт
	
	Таб.Очистить();
	
	М = Документы.ПриходнаяНакладная.ПолучитьМакет("Печать");
	С = Новый Структура;
	гоВставитьКучу(С, "Загол, ИмяПокупателя1, ИмяПокупателя2, ИмяПокупателя3, ИмяПоставщика1, ИмяПоставщика2, ИмяПоставщика3, ИмяПоставщика4, ИмяПоставщика5, ИмяПоставщика6");
	гоВставитьКучу(С, "ИмяСклада, ДопНомера, НомерПП, лНоменклатура, лЕИ, лКоличество, лЦена, лСумма, сКоличество, СтрСНДС");
	гоВставитьКучу(С, "лВалюта");
	//2016.04.07
	гоВставитьКучу(С, "лСерия");
	
	С.Загол = "Приходная накладная № " + Тек.Номер + " от " + гоДата(Тек.Дата);
	С.ИмяСклада = "";
	С.ИмяПоставщика1 = "";
	С.ИмяПоставщика2 = "";
	С.ИмяПоставщика3 = "";
	С.ИмяПоставщика4 = "";
	С.ИмяПоставщика5 = "";
	С.ИмяПоставщика6 = "";
	С.ИмяПокупателя1 = "";
	С.ИмяПокупателя2 = "";
	С.ИмяПокупателя3 = "";

	Если гоНПЗ(Тек.Контрагент) Тогда        
		Если РольДоступна("ЧтениеИзменениеНаименованийКонтрагентов") Тогда
			С.ИмяПоставщика1 = СокрЛП(Тек.Контрагент.ПолнНаименование);
			Если С.ИмяПоставщика1 = "" Тогда С.ИмяПоставщика1 = СокрЛП(Тек.Контрагент.Наименование) КонецЕсли;
		Иначе
			С.ИмяПоставщика1 = СокрЛП(Тек.Контрагент.Псевдоним);
			Если С.ИмяПоставщика1 = "" Тогда С.ИмяПоставщика1 = СокрЛП(Тек.Контрагент.Псевдоним) КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если гоНПЗ(Тек.Фирма) Тогда
		С.ИмяПокупателя1 = СокрЛП(Тек.Фирма.ПолнНаименование);
	КонецЕсли;
	
	Фикс = 4;
	ВывестиСекцию(Таб, М, "ШапкаП1", С); гоПлюс(Фикс);
	Если С.ИмяПоставщика2 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаП2", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика3 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаП3", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика4 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаП4", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика5 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаП5", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика6 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаП6", С); гоПлюс(Фикс); КонецЕсли;
	ВывестиСекцию(Таб, М, "ШапкаК1", С); гоПлюс(Фикс);
	Если С.ИмяПокупателя2 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаК2", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПокупателя3 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаК3", С); гоПлюс(Фикс); КонецЕсли;
	
	ВывестиСекцию(Таб, М, "Шапка", С);
	
	Табл = Тек.Товары.Выгрузить();
	
	//2016.04.07
	Если Поз = 2 Тогда 
		Сабл = Табл.Скопировать();
		Сабл.Свернуть("Номенклатура, ЦенаЗакупки, Серия", "Количество, СуммаЗакупки");
		Сабл.Сортировать("Номенклатура ВОЗР, ЦенаЗакупки ВОЗР, Серия ВОЗР");
		Сабл.Индексы.Добавить("Номенклатура, ЦенаЗакупки");
	КонецЕсли; 
	
	Табл.Свернуть("Номенклатура, ЦенаЗакупки", "Количество, СуммаЗакупки");
	
	С.лВалюта = СокрЛП(Тек.Валюта);
	
	ЧислоЗнаковЦена = Тек.Фирма.ЧислоЗнаковЦенаЗакупки;
	
	НомерПП = 0;
	Для Каждого _Табл Из Табл Цикл
		гоПлюс(НомерПП);
		
		С.лНоменклатура = гоИмя(_Табл.Номенклатура, Ложь);
		С.НомерПП = НомерПП;
		С.лЕИ = "шт.";
		С.лКоличество = _Табл.Количество;
		С.лЦена = гоСуммаЗн(_Табл.ЦенаЗакупки, ЧислоЗнаковЦена);
		С.лСумма = гоЦена2(_Табл.СуммаЗакупки);
		
		ВывестиСекцию(Таб, М, "Строка", С);
		
		//2016.04.07
		Если Поз = 2 Тогда
			Мас = Сабл.НайтиСтроки(Новый Структура("Номенклатура, ЦенаЗакупки", _Табл.Номенклатура, _Табл.ЦенаЗакупки));
			Для Каждого _Сабл Из Мас Цикл
				С.лСерия = _Сабл.Серия;
				С.лКоличество = _Сабл.Количество;
				ВывестиСекцию(Таб, М, "СтрокаС", С);
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла;
	
	С.лКоличество = Табл.Итог("Количество");
	С.лСумма = гоЦена2(Тек.Сумма);
	С.СтрСНДС = гоСуммаПрописьюВал(Тек.Сумма, Тек.Валюта);
		
	ВывестиСекцию(Таб, М, "Подвал", С);
	
	глПараметрыСтраницы(Таб, 1);
	глПовторятьПриПечатиСтроки(Таб, Фикс, Фикс); 
	
КонецПроцедуры

#КонецЕсли  

// © Primus1C  24.07.2023  НАЧАЛО ►

// Функция проверяет остатки вне зависимости от даты
// (чтобы задним числом нельзя было сделать повторное оприходование).
// Поставка=0 -- для инвойсов, не разделенных на поставки
Функция НеоприходованныеТоварыИнвойса(СсылкаИнвойс, Поставка=0) Экспорт
	
	Результат = Новый Структура("ЕстьНеоприходованныеТовары", Ложь); 
	
	ПоставкиИсх = Новый Соответствие;
	ЗапрП = Новый Запрос; 
	ЗапрП.УстановитьПараметр("Инвойс",   СсылкаИнвойс);
	ЗапрП.Текст = "ВЫБРАТЬ
	              |	СУММА(_ИнвойсПоставки.Количество) КАК Количество,
	              |	_ИнвойсПоставки.Поставка КАК Поставка
	              |ИЗ
	              |	Документ._Инвойс.Поставки КАК _ИнвойсПоставки
	              |ГДЕ
	              |	_ИнвойсПоставки.Ссылка = &Инвойс
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	_ИнвойсПоставки.Поставка";
	ВыборкаП = ЗапрП.Выполнить().Выбрать();
    Пока ВыборкаП.Следующий() Цикл
		ПоставкиИсх.Вставить(ВыборкаП.Поставка, ВыборкаП.Количество);	
	КонецЦикла;
	
	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Инвойс",   СсылкаИнвойс);
	Запр.Текст = "ВЫБРАТЬ
	             |	ОприходНоменклатуры.Поставка КАК Поставка,
	             |	ОприходНоменклатуры.Номенклатура КАК Номенклатура,
	             |	ОприходНоменклатуры.КоличествоОстаток КАК Количество,
	             |	ОприходНоменклатуры.СуммаЗакупкиОстаток КАК СуммаЗакупки,
	             |	ОприходНоменклатуры.СуммаСоСкидкойОстаток КАК СуммаСоСкидкой
	             |ИЗ
	             |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Остатки(
	             |			,
	             |			Документ = &Инвойс
	             |				И ИСТИНА = ИСТИНА) КАК ОприходНоменклатуры
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Поставка";
	Если Поставка <> 0 Тогда 
		Запр.Текст = СтрЗаменить(Запр.Текст, "ИСТИНА = ИСТИНА", "Поставка = &Поставка");
		Запр.УстановитьПараметр("Поставка", Поставка);
	КонецЕсли;
	
	КоличествоНеоприходованныхПоставок = 0;  
	масПоставки = Новый Массив;
	Выгрузка = Запр.Выполнить().Выгрузить(); 
	НачПоставка = ?(СсылкаИнвойс.КоличествоПоставок=0, 0, 1);
	Для П = НачПоставка По СсылкаИнвойс.КоличествоПоставок Цикл
		НайдСтроки = Выгрузка.НайтиСтроки(Новый Структура("Поставка", П)); 
		масТоваров = Новый Массив;
		лКоличество = 0;
		Для каждого НайдСтрока Из НайдСтроки Цикл
			масТоваров.Добавить(Новый Структура("Номенклатура, Количество, СуммаЗакупки, СуммаСоСкидкой", 
												НайдСтрока.Номенклатура, НайдСтрока.Количество, НайдСтрока.СуммаЗакупки, НайдСтрока.СуммаСоСкидкой)); 
			лКоличество = лКоличество + НайдСтрока.Количество;
		КонецЦикла;   
		масПоставки.Добавить(Новый Структура("НомерПоставки, Количество, КоличествоИсх, Товары", П, лКоличество, ПоставкиИсх.Получить(П), масТоваров)); 
		Если лКоличество > 0 Тогда
			Результат.Вставить("ЕстьНеоприходованныеТовары", Истина);
			Результат.Вставить("НомерНеоприходованнойПоставки", П);
			КоличествоНеоприходованныхПоставок = КоличествоНеоприходованныхПоставок + 1;
		КонецЕсли;
	КонецЦикла;
	Результат.Вставить("КоличествоНеоприходованныхПоставок", КоличествоНеоприходованныхПоставок);
	Результат.Вставить("Поставки", масПоставки);
	
	Возврат Результат; 
	
КонецФункции 

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("БезСерий, ПоСериям", 
							НСтр("ru='Приходная накладная (без серий)';en='Incoming waybill (no series)'"), 
							НСтр("ru='Приходная накладная (по сериям)';en='Incoming waybill (with series)'"));		

КонецФункции 

Процедура ПечатьДокумента(ДокСсылка, ВариантПечатнойФормы, ТабДокумент, Параметры = 0) Экспорт
	
	ТабДокумент.Очистить();  

	Если РольДоступна("Администратор") ИЛИ РольДоступна("ЗакупкаПродажаВозврат") ИЛИ РольДоступна("Бухгалтерия") ИЛИ РольДоступна("МетреонПолный") Тогда
		ИмяМакета = "НакладнаяСуммы";
	Иначе
		ИмяМакета = "НакладнаяБезСумм";
	КонецЕсли;
	Макет = Документы.ПриходнаяНакладная.ПолучитьМакет(ИмяМакета);
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", ДокСсылка);
	Запр.УстановитьПараметр("ПредставлениеДокумента",  ОбщегоНазначения.ПредставлениеДокументаДляПечати(ДокСсылка, ));
	Запр.Текст = "ВЫБРАТЬ
	             |	Накладная.Номер КАК Номер,
	             |	Накладная.Дата КАК Дата,
	             |	Накладная.Контрагент КАК Контрагент,
	             |	Накладная.Фирма.ПолнНаименование КАК Покупатель,
	             |	Накладная.Сумма КАК Сумма,
	             |	Накладная.Валюта КАК Валюта,
	             |	Накладная.Склад КАК Склад,
	             |	Накладная.ВКД_Количество КАК Количество,
	             |	Накладная.Поставка КАК Поставка,
	             |	ВЫРАЗИТЬ(Накладная.Примечание КАК СТРОКА(1000)) КАК Примечание,
	             |	&ПредставлениеДокумента КАК ПредставлениеДокумента
	             |ИЗ
	             |	Документ.ПриходнаяНакладная КАК Накладная
	             |ГДЕ
	             |	Накладная.Ссылка = &Ссылка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	0 КАК Ном,
	             |	Товары.Ссылка.Валюта КАК Валюта,
	             |	Товары.Номенклатура КАК Номенклатура,
	             |	Товары.Серия КАК Серия,
	             |	Товары.ЦенаЗакупки КАК Цена,
	             |	Товары.Количество КАК Количество,
	             |	Товары.СуммаЗакупки КАК Сумма
	             |ИЗ
	             |	Документ.ПриходнаяНакладная.Товары КАК Товары
	             |ГДЕ
	             |	Товары.Ссылка = &Ссылка
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Номенклатура,
	             |	Серия,
	             |	Цена";   
	ОбщегоНазначенияСервер.УстановитьПредставлениеКонтрагентаВЗапросе(Запр.Текст, "Накладная.Контрагент");	
	РезультатЗапроса = Запр.ВыполнитьПакет();
	
	Шапка = РезультатЗапроса[0].Выбрать();
	Шапка.Следующий(); 
	ВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка); 

	Выгрузка = РезультатЗапроса[1].Выгрузить();
	Если ВариантПечатнойФормы = "ПоСериям" Тогда  
		Если ИмяМакета = "НакладнаяСуммы" Тогда
			Поля = ",Серия,Цена"; 
		Иначе
			Поля = ",Серия"; 
		КонецЕсли;
	Иначе
		Если ИмяМакета = "НакладнаяСуммы" Тогда
			Поля = ",Цена"; 
		Иначе
			Поля = ""; 
		КонецЕсли;	
	КонецЕсли;  
	Выгрузка.Свернуть("Валюта,Номенклатура" + Поля, "Ном,Количество,Сумма");
	
	Товары = Выгрузка.Скопировать(); 
	Если ИмяМакета = "НакладнаяСуммы" Тогда
		Товары.Свернуть("Ном,Валюта,Номенклатура,Цена", "Количество,Сумма");
	Иначе
		Товары.Свернуть("Ном,Валюта,Номенклатура", "Количество");
	КонецЕсли;
	
	Ном = 0;
	ТабДокумент.НачатьАвтогруппировкуСтрок();
	Для каждого СтрокаТовар Из Товары Цикл 
		Ном = Ном + 1;
		СтрокаТовар.Ном = Ном;	
		ВывестиСекцию(ТабДокумент, Макет, "Строка", СтрокаТовар, 1);
		Если ВариантПечатнойФормы = "ПоСериям" Тогда
			Если ИмяМакета = "НакладнаяСуммы" Тогда
				Отбор = Новый Структура("Номенклатура,Цена", СтрокаТовар.Номенклатура, СтрокаТовар.Цена)	
			Иначе
				Отбор = Новый Структура("Номенклатура", СтрокаТовар.Номенклатура)	
			КонецЕсли;	
			СтрокиСерии = Выгрузка.НайтиСтроки(Отбор);
			Для каждого НайдСтрока Из СтрокиСерии Цикл
				ВывестиСекцию(ТабДокумент, Макет, "Серия", НайдСтрока, 2);
			КонецЦикла;   
	    КонецЕсли;
	КонецЦикла;	
	ТабДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	ОбластьДно = Макет.ПолучитьОбласть("Дно");
	ОбластьДно.Параметры.Заполнить(Шапка);
	ОбластьДно.Параметры.СуммаПрописью = гоСуммаПрописьюВал(Шапка.Сумма, Шапка.Валюта);
	ТабДокумент.Вывести(ОбластьДно);
	
КонецПроцедуры

Функция ЗатратыОтправки(Инвойс, Поставка) Экспорт

 	СоотвЗатрат = Новый Соответствие; 
	Если НЕ ЗначениеЗаполнено(Инвойс) Тогда
		Возврат СоотвЗатрат;
	КонецЕсли;
	 Запр = Новый Запрос; 
	 Запр.УстановитьПараметр("Инвойс", 		Инвойс);
	 Запр.УстановитьПараметр("Поставка", 	Поставка);
	 Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	ОтправкаРаспределениеЗатрат.Номенклатура КАК Номенклатура,
	              |	ОтправкаРаспределениеЗатрат.Цена КАК Цена
	              |ИЗ
	              |	Документ.Отправка.РаспределениеЗатрат КАК ОтправкаРаспределениеЗатрат
	              |ГДЕ
	              |	ОтправкаРаспределениеЗатрат.Ссылка В
	              |			(ВЫБРАТЬ
	              |				ОтправкаИнвойсы.Ссылка
	              |			ИЗ
	              |				Документ.Отправка.Инвойсы КАК ОтправкаИнвойсы
	              |			ГДЕ
	              |				ОтправкаИнвойсы.Инвойс = &Инвойс
	              |				И ОтправкаИнвойсы.Поставка = &Поставка
	              |				И ОтправкаИнвойсы.Ссылка.Проведен)"; 
	 Выборка = Запр.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		СоотвЗатрат.Вставить(Выборка.Номенклатура, Выборка.Цена); 
	 КонецЦикла;
	 
	 Возврат СоотвЗатрат;

КонецФункции

Процедура ВывестиСекцию(Таб, Макет, Область, Параметры, Уровень=Неопределено) 
	Ш = Макет.ПолучитьОбласть(Область); 
	Ш.Параметры.Заполнить(Параметры);  
	Если Уровень=Неопределено Тогда
		Таб.Вывести(Ш);
	Иначе
		Таб.Вывести(Ш, Уровень);
	КонецЕсли;
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
